Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: For the adventurous, edit the file "feature.h".
es_es: Para los atrevido, edite el archivo «feature.h».

source: You can also change the source code yourself!
es_es: ¡También puede modificar el código fuente directamente!

source: There are two ways to install the Vim program for Microsoft Windows.
es_es: Existen dos formas de instalar el programa Vim para Microsoft Windows.

source: You can uncompress several archives, or use a self-installing big archive.
es_es: Puede descomprimir varios archivos, o usar un sólo archivo de instalación automática.

source: Most users with fairly recent computers will prefer the second method.
es_es: La mayoría de usuarios con ordenadores relativamente recientes pueden preferir el segundo método.

source: For the first one, you will need:
es_es: Se requiere lo siguiente para usar el primero:

source: - An archive with binaries for Vim.
es_es: - Un archivo con binarios para Vim.

source: - The Vim runtime archive.
es_es: - El archivo de tiempo de ejecución («runtime) de Vim.

source: - A program to unpack the zip files.
es_es: - Un programa para desempaquetar los archivos zip.

source: Go to the "pc" directory and you'll find a list of files there.
es_es: Vaya al directorio «pc» y verá una lista de archivos.

source: We will use "61" here, which is version 6.1.
es_es: En este documento se usará «61», la versión 6.1.

source: This is all you need for the second method.
es_es: Esto es todo lo que necesita para el segundo método.

source: Just launch the executable, and follow the prompts.
es_es: Simplemente ejecute el archivo, y siga los diálogos.

source: For the first method you must chose one of the binary archives.
es_es: Debe escoger uno de los archivos binarios para realizar el primer método.

source: These are available:
es_es: Los siguientes están disponibles:

source: gvim61.zip The normal MS-Windows GUI version.
es_es: gvim61.zip La versión de interfaz gráfica normal de MS Windows.

source: gvim61ole.zip The MS-Windows GUI version with OLE support.
es_es: gvim61ole.zip La versión gráfica de MS Windows con compatibilidad con OLE.

source: Uses more memory, supports interfacing with other OLE applications.
es_es: Usa más memoria, permite interactuar con otras aplicaciones OLE.

source: vim61w32.zip 32 bit MS-Windows console version.
es_es: vim61w32.zip La versión de consola de 32 bit para MS Windows.

source: For use in a Win NT/2000/XP console.
es_es: Para el uso en una consola Win NT/2000/XP console.

source: Does not work well on Win 95/98.
es_es: No funciona bien en Win 95/98.

source: vim61d32.zip 32 bit MS-DOS version.
es_es: vim61d32.zip Versión de 32 bit para MS-DOS.

source: For use in the Win 95/98 console window.
es_es: Para el uso en una ventana de consola de Win 95/98.

source: vim61d16.zip 16 bit MS-DOS version.
es_es: vim61d16.zip Versión de 16 bit para MS-DOS.

source: Only for old systems.
es_es: Sólo para sistemas antiguos.

source: Does not support long filenames.
es_es: No permite el uso de nombres de archivo largos.

source: You only need one of them.
es_es: Sólo necesita uno de estos.

source: Although you could install both a GUI and a console version.
es_es: Aunque puede instalar la versión gráfica y una versión de intérprete de órdenes.

source: You always need to get the archive with runtime files.
es_es: Siempre necesita obtener el archivo con los archivos de tiempo de ejecución.

source: Use your un-zip program to unpack the files.
es_es: Use su programa un-zip para descomprimir lso archivos.

source: For example, using the "unzip" program: >
es_es: Por ejemplo, usando el programa «unzip»: >

source: This will unpack the files in the directory "c:\vim\vim61".
es_es: Éstas órdenes desempaquetarán los ficheros en el directorio «c:\vim\vim61».

source: If you already have a "vim" directory somewhere, you will want to move to the directory just above it.
es_es: Si ya tiene un directorio «vim», puede navegar al directorio superior a él.

source: Now change to the "vim\vim61" directory and run the install program: >
es_es: Ahora, entre al directorio «vim\vim61» y ejecute el programa de instalación: >

source: Carefully look through the messages and select the options you want to use.
es_es: Revise los mensajes con cuidado y seleccione las opciones que desea usar.

source: If you finally select "do it" the install program will carry out the actions you selected.
es_es: Si al final selecciona «do it», el programa de instalación llevará a cabo las acciones seleccionadas.

source: The install program doesn't move the runtime files.
es_es: El programa de instalación no reubica los archivos de tiempo de ejecución.

source: They remain where you unpacked them.
es_es: Permanecerán en el lugar en el que los desempaquetó.

source: In case you are not satisfied with the features included in the supplied binaries, you could try compiling Vim yourself.
es_es: En el caso de que no esté satisfecho con las características incluidas en los binarios proporcionados, puede intentar compilar Vim.

source: Get the source archive from the same location as where the binaries are.
es_es: Obtenga el archivo de fuentes de la misma ubicación de los binarios.

source: You need a compiler for which a makefile exists.
es_es: Necesitará un compilador que permita «makefiles».

source: Microsoft Visual C works, but is expensive.
es_es: Microsoft Visual C funciona, pero es caro.

source: The Free Borland command-line compiler 5.5 can be used, as well as the free MingW and Cygwin compilers.
es_es: Puede usar el compilador de línea de órdenes libre Borland 5.5, así como los compiladores libres MingW y Cygwin.

source: Check the file src/INSTALLpc.txt for hints.
es_es: Consulte el archivo «src/INSTALLpc.txt» para más indicaciones.

source: When you type "make install" the runtime files will be copied to a directory which is specific for this version.
es_es: Cuando teclea «make install», los ficheros de tiempo de ejecución se copiarán un directorio específico a la versión.

source: Thus they will not overwrite a previous version.
es_es: Por ello, no sobreescribirán una versión anterior.

source: This makes it possible to use two or more versions next to each other.
es_es: Esto permite usar dos o más versiones simultáneamente.

source: The executable "vim" will overwrite an older version.
es_es: El ejecutable «vim» sobreescribirá una versión anterior.

source: If you don't care about keeping the old version, running "make install" will work fine.
es_es: Si no le interesa preservar la versión más antigua, ejecutar «make install» funcionará sin problemas.

source: You can delete the old runtime files manually.
es_es: Puede eliminar los archivos de tiempo de ejecución manualmente.

source: Just delete the directory with the version number in it and all files below it.
es_es: Simplemente elimine el directorio con el número de versión y todos los archivos contenidos en él.

source: There are normally no changed files below this directory.
es_es: Generalmente, bajo este directorio no hay archivos modificados.

source: If you did change the "filetype.vim" file, for example, you better merge the changes into the new version before deleting it.
es_es: Si ha modificado el archivo «filetype.vim», por ejemplo, será mejor que introduzca esos cambios en la versión nueva antes de eliminar el archivo.

source: If you are careful and want to try out the new version for a while before switching to it, install the new version under another name.
es_es: Si es cuidadoso y desea probar la nueva versión durante un tiempo antes de cambiar a ella, instale la nueva versión bajo otro nombre.

source: You need to specify a configure argument.
es_es: Necesita especificar un argumento de configuración.

source: Before running "make install", you could use "make -n install" to check that no valuable existing files are overwritten.
es_es: Debería usar «make -n install» antes de ejecutar «make install» para comprobar que no se sobreescribirá ningún archivo valioso.

source: When you finally decide to switch to the new version, all you need to do is to rename the binary to "vim".
es_es: Cuando decida pasar a la nueva versión, todo lo que necesita hacer es renombrar el binario a «vim».

source: Upgrading is mostly equal to installing a new version.
es_es: Actualizar es casi idéntico a instalar una versión nueva.

source: Just unpack the files in the same place as the previous version.
es_es: Sencillamente desempaquete los archivos en la misma ubicación de la versión anterior.

source: A new directory will be created, e.g., "vim61", for the files of the new version.
es_es: Se creará un directorio nuevo, esto es, «vim61», para los archivos de la versión nueva.

source: Your runtime files, vimrc file, viminfo, etc. will be left alone.
es_es: Sus archivos de tiempo de ejecución, «vimrc» y «viminfo» no se modificarán.

source: If you want to run the new version next to the old one, you will have to do some handwork.
es_es: Si desea ejecutar la nueva versión junto a la antigua, tendrá que hacer algún trabajo manual.

source: Don't run the install program, it will overwrite a few files of the old version.
es_es: No ejecute el programa de instalación, ya que sobreescribirá algunos archivos de la versión antigua.

source: Execute the new binaries by specifying the full path.
es_es: Ejecute los binarios nuevos especificando la ruta completa.

source: The program should be able to automatically find the runtime files for the right version.
es_es: El programa debería averiguar automáticamente la ubicación de los archivos de tiempo de ejecución para la versión adecuada.

source: However, this won't work if you set the $VIMRUNTIME variable somewhere.
es_es: Por otra parte, no funcionará si define en algún lugar la variable «$VIMRUNTIME».

source: If you are satisfied with the upgrade, you can delete the files of the previous version.
es_es: Si la actualización le satisface, puede eliminar los archivos de la versión anterior.

source: See |90.5|.
es_es: Consulte |90.5|.

source: This section describes some of the common problems that occur when installing Vim and suggests some solutions.
es_es: Esta sección describe algunos de los problemas más habituales al instalar Vim, y sugiere algunas soluciones.

source: It also contains answers to many installation questions.
es_es: También contiene respuestas a muchas preguntas sobre la instalación.

source: Q: I Do Not Have Root Privileges.
es_es: P: No tengo privilegios de administrador.

source: How Do I Install Vim?
es_es: ¿Cómo puedo instalar Vim?

source: This gives you a personal copy of Vim.
es_es: Esto genera una copia personal de Vim.

source: You need to put $HOME/bin in your path to execute the editor.
es_es: Necesita poner «$HOME/bin» en su ruta (variable PATH) para ejecutar el editor.

source: Also see |install-home|.
es_es: Consulte también |install-home|.

source: Q: The Colors Are Not Right on My Screen.
es_es: P: Los colores no son los correctos en mi pantalla.

source: If the terminal type listed is not correct, fix it.
es_es: Si el tipo de terminal listado no es el correcto, corríjalo.

source: For more hints, see |06.2|.
es_es: Para más indicaciones, consulte |06.2|.

source: Another solution is to always use the GUI version of Vim, called gvim.
es_es: Otra solución es usar siempre la versión gráfica de usuario de Vim, llamado gvim.

source: This avoids the need for a correct terminal setup.
es_es: Esto último evita la necesidad de una correcta configuración de terminal.

source: The definition of what key sends what code is very unclear for backspace <BS> and Delete <Del> keys.
es_es: La definición del código que cada tecla envía no está muy clara con las teclas de retroceso <BS> y eliminar <Del>.

source: First of all, check your $TERM setting.
es_es: Primero, compruebe su opción de configuración «$TERM».

source: If there is nothing wrong with it, try this: >
es_es: Si no detecta nada incorrecto: pruebe esto: >

source: In the first line you need to press CTRL-V and then hit the backspace key.
es_es: En la primera línea tiene que pulsar «CTRL-V» y después pulsar la tecla de retroceso.

source: In the second line you need to press CTRL-V and then hit the Delete key.
es_es: En la segunda, debe pulsar «CTRL-V» y pulsar la tecla de eliminar.

source: You can put these lines in your vimrc file, see |05.1|.
es_es: Puede poner estas líneas en su archivo «vimrc», consulte |05.1|.

source: A disadvantage is that it won't work when you use another terminal some day.
es_es: Una desventaja es que no funcionará cuando use otra terminal.

source: Look here for alternate solutions: |:fixdel|.
es_es: Consulte aquí las posibles soluciones: |:fixdel|.

source: Q: I Am Using RedHat Linux.
es_es: P: Uso RedHat Linux.

source: Can I Use the Vim That Comes with the System?
es_es: ¿Puedo usar la versión de Vim que viene con el sistema?

source: By default RedHat installs a minimal version of Vim.
es_es: Por omisión, RedHat instala una versión mínima de Vim.

source: Check your RPM packages for something named "Vim-enhanced-version.rpm" and install that.
es_es: Busque entre los paquetes RPM algo llamado «Vim-enhanced-version.rpm» e instale ese paquete.

source: Q: How Do I Turn Syntax Coloring On?
es_es: P: ¿Como se activa el resaltado de sintaxis?

source: How do I make plugins work?
es_es: ¿Como hago funcionar las extensiones?

source: Use the example vimrc script.
es_es: Use el script de ejemplo «vimrc».

source: You can find an explanation on how to use it here: |not-compatible|.
es_es: Encontrará una explicación de su uso en el siguiente apartado: |not-compatible|.

source: Many users have uploaded useful Vim scripts and plugins there.
es_es: Muchos usuarios han enviado útiles scripts de Vim y extensiones a esta ubicación de Internet.

source: There is an archive with hints from Vim users.
es_es: Hay un archivo con indicaciones de usuarios de Vim.

source: You might also want to search in the |maillist-archive|.
es_es: Puede que también desee buscar en el archivo de la lista de correo, |maillist-archive|.

source: When you installed Vim as a package, check your package manager to find out how to remove the package again.
es_es: Si ha instalado Vim como un paquete, compruebe su gestor de paquetes para averiguar cómo eliminar el paquete.

source: If you installed Vim from sources you can use this command: >
es_es: Si ha instalado Vim a partir de las fuentes, puede usar la siguiente orden: >

source: However, if you have deleted the original files or you used an archive that someone supplied, you can't do this.
es_es: Sin embargo, si ha eliminado los archivos originales, o ha usado un archivo que alguien le ha proporcionado, no podrá hacer esto.

source: Do delete the files manually, here is an example for when "/usr/local" was used as the root: >
es_es: Este es un ejemplo de desinstalación manual de Vim cuando «/usr/local» se ha usado como el directorio raíz.

source: If you installed Vim with the self-installing archive you can run the "uninstall-gui" program located in the same directory as the other Vim programs, e.g.
es_es: Si ha instalado Vim el archivo de instalación automática, puede ejecutar el programa «uninstall-gui», ubicado en el mismo directorio de otros programas de Vim.

source: "c:\vim\vim61".
es_es: Esto es, «c:\vim\vim61».

source: You can also launch it from the Start menu if installed the Vim entries there.
es_es: También puede iniciarlo desde el menú de aplicaciones si ha instalado las entradas de Vim.

source: This will remove most of the files, menu entries and desktop shortcuts.
es_es: Esto elimina la mayoría de los archivos, entradas de menú y enlaces directos.

source: Some files may remain however, as they need a Windows restart before being deleted.
es_es: Sin embargo, algunos archivos permanecerán en el sistema, ya que necesitan un reinicio de Windows antes de su eliminación.

source: You will be given the option to remove the whole "vim" directory.
es_es: Se le dará la opción de eliminar todo el directorio «vim».

source: It probably contains your vimrc file and other runtime files that you created, so be careful.
es_es: Probablemente, contiene su archivo «vimrc» y otros archivos de tiempo de ejecución que ha creado, tenga cuidado.

source: *gui_x11.txt* For Vim version 7.2.
es_es: *gui_x11.txt* Para Vim versión 7.2.

source: Last change: 2007 Dec 09
es_es: Último cambio: 2007 Dec 09

source: Vim's Graphical User Interface *gui-x11* *GUI-X11* *Athena* *Motif* 1.
es_es: Interfaz gráfica de usuario de Vim *gui-x11* *GUI-X11* *Athena* *Motif* 1.

source: Starting the X11 GUI |gui-x11-start| 2.
es_es: Iniciar GUI para X11 |gui-x11-start| 2.

source: GUI Resources |gui-resources| 3.
es_es: Recursos de la GUI |gui-resources| 3.

source: Shell Commands |gui-pty| 4.
es_es: Órdenes del intérprete de órdenes |gui-pty| 4.

source: Various |gui-x11-various| 5.
es_es: Varios |gui-x11-various| 5.

source: GTK version |gui-gtk| 6.
es_es: Versión GTK |gui-gtk| 6.

source: GNOME version |gui-gnome| 7.
es_es: Versión GNOME |gui-gnome| 7.

source: KDE version |gui-kde| 8.
es_es: Versión KDE |gui-kde| 8.

source: Compiling |gui-x11-compiling| 9.
es_es: Compilar |gui-x11-compiling| 9.

source: X11 selection mechanism |x11-selection|
es_es: Mecanismo de selección de X11 |x11-selection|

source: Starting the X11 GUI *gui-x11-start* *E665*
es_es: Iniciando la IGU de X11 *gui-x11-start* *E665*

source: So if you call the executable "gvim", or make "gvim" a link to the executable, then the GUI version will automatically be used.
es_es: Por ello, si invoca el ejecutable «gvim», o enlaza «gvim» al ejecutable, la interfaz gráfica se usará automáticamente.

source: Additional characters may be added after "gvim", for example "gvim-5".
es_es: Se pueden añadir caracteres adicionales tras «gvim», «gvim-5» por ejemplo.

source: *gui-fork* When the GUI is started, it does a fork() and exits the current process.
es_es: *gui-fork* Cuando inicia la GUI, crea un «fork()» y termina el proceso actual.

source: When gvim was started from a shell this makes the shell accept further commands.
es_es: Cuando se ha iniciado gvim desde un interprete de órdenes, esto hace que la consola pueda recibir futuras órdenes.

source: If you don't want this (e.g. when using gvim for a mail program that waits for gvim to exit), start gvim with "gvim -f", "vim -gf" or use ":gui -f".
es_es: Si no desea esto, (p. ej., cuando usa gvim para un programa de correo que espera a que gvim se cierre), inicie gvim con «gvim -f», «vim -gf» o use «:gui -f».

source: Don't use "vim -fg", because "-fg" specifies the foreground color.
es_es: No use «vim -fg» porque «-fg» especifica el color en primer plano.

source: When using "gvim -f" and then ":gui", Vim will run in the foreground.
es_es: Si usa «gvim -f», y después «:gui», Vim se ejectuará en primer plano.

source: The "-f" argument will be remembered.
es_es: El argumento «-f» se recordará.

source: To force running Vim in the background use ":gui -b".
es_es: Para forzar que Vim se inicie de fondo, use «gui -b».

source: If you want the GUI to run in the foreground always, include the 'f' flag in 'guioptions'.
es_es: Si desea que la IGU siempre se ejecute en primer plano, incluya la marca «f» en 'guioptions'.

source: GUI Resources *gui-resources* *.Xdefaults*
es_es: Recursos de la IGU *gui-resources* *.Xdefaults*

source: If using the Motif or Athena version of the GUI (not for the KDE, GTK+ or Win32 version), a number of X resources are available.
es_es: En caso de que este usando la versión Motif o Athena de la IGU (no la versión de KDE, GTK+ o Win32), no dispondrá de una serie de recursos.

source: You should use Vim's class "Vim" when setting these.
es_es: Debería usar la clase de Vim «Vim» cuando define esto.

source: They are as follows:
es_es: Son como sigue:

source: reverseVideo Boolean: should reverse video be used?
es_es: reverseVideo Boolean: ¿Se debe usar el vídeo inverso?

source: background Color of background.
es_es: background Color del fondo.

source: foreground Color of normal text.
es_es: foreground Color del texto normal.

source: scrollBackground Color of trough portion of scrollbars.
es_es: scrollBackground Color de la porción pilón de las barras de desplazamiento.

source: scrollForeground Color of slider and arrow portions of scrollbars.
es_es: scrollForeground Color de la barra y las porciones de flecha de las barras desplazamiento.

source: menuBackground Color of menu backgrounds.
es_es: menuBackground Color de fondo del menú.

source: menuForeground Color of menu foregrounds.
es_es: menuForeground Color de primer plano del menú.

source: tooltipForeground Color of tooltip and balloon foreground.
es_es: tooltipForeground Color de primer plano de las sugerencias y de los globos.

source: tooltipBackground Color of tooltip and balloon background.
es_es: tooltipBackground Color de fondo de las sugerencias y de los globos.

source: *gui.txt* For Vim version 7.2.
es_es: *gui.txt* Para Vim version 7.2.

source: Starting the GUI |gui-start| 2.
es_es: Iniciar la GUI |gui-start| 2.

source: Scrollbars |gui-scrollbars| 3.
es_es: Barras de desplazamiento |gui-scrollbars| 3.

source: Mouse Control |gui-mouse| 4.
es_es: Control del ratón |gui-mouse| 4.

source: Making GUI Selections |gui-selections| 5.
es_es: Seleccionar en la GUI |gui-selections| 5.

source: Menus |menus| 6.
es_es: Menús |menus| 6.

source: Shell Commands |gui-shell|
es_es: Órdenes de consola |gui-shell|

source: Other GUI documentation: |gui_x11.txt| For specific items of the X11 GUI.
es_es: Más documentación de la GUI: |gui_x11.txt| Para elementos específicos de la GUI bajo X11.

source: |gui_w32.txt| For specific items of the Win32 GUI.
es_es: |gui_w32.txt| Para elementos específicos de la GUI bajo Win32.

source: Starting the GUI *gui-start* *E229* *E233*
es_es: Iniciar la GUI *gui-start* *E229* *E233*

source: First you must make sure you actually have a version of Vim with the GUI code included.
es_es: Asegúrese primero de que realmente tiene una versión de Vim con el código de la GUI integrado.

source: You can check this with the ":version" command, it says "with xxx GUI", where "xxx" is X11-Motif, X11-Athena, Photon, GTK, GTK2, etc., or "MS-Windows 32 bit GUI version".
es_es: Puede revisar esto con la orden :version, el cual devuelve «con GUI xxx», donde «xxx» puede ser X11-Motif, X11-Athena, Photon, GTK, GTK2, etc... o «versión GUI MS-Windows 32 bit».

source: How to start the GUI depends on the system used.
es_es: Como iniciar la interfaz gráfica depende del sistema que se usa.

source: Mostly you can run the GUI version of Vim with: gvim [options] [files...]
es_es: Generalmente, puede iniciar la versión GUI de Vim con: gvim [opciones] [archivos...]

source: The X11 version of Vim can run both in GUI and in non-GUI mode.
es_es: La versión X11 de Vim puede ejecutarse en modo gráfico o no.

source: See |gui-x11-start|.
es_es: Véase |gui-x11-start|.

source: *gui-init* *gvimrc* *.gvimrc* *_gvimrc* The gvimrc file is where GUI-specific startup commands should be placed.
es_es: *gui-init* *gvimrc* *.gvimrc* *_gvimrc* El archivo gvimrc es donde debe escribir las órdenes de inicio específicos de la GUI.

source: It is always sourced after the |vimrc| file.
es_es: Siempre se lee después del archivo |vimrc|.

source: If you have one then the $MYGVIMRC environment variable has its name.
es_es: Si tiene uno, la variable de entorno $MYGVIMRC llevará su tal nombre.

source: All this happens AFTER the normal Vim initializations, like reading your .vimrc file.
es_es: Todo esto ocurre despues de las órdenes de inicio de Vim, como si leyese el archivo «.vimrc».

source: See |initialization|.
es_es: Véase |initialization|.
